# PipingTemperature Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipingTemperature Property
SpecTypeId Class See Also
---
Temperature, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipingTemperature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingTemperature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingTemperature {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace